#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.cloud_key: Refreshing state... [id=0a6b5d282bb0c55a95ae3e376be2fb92707d9f5d]
aws_key_pair.cloud_key: Refreshing state... [id=cloud_key]
data.aws_ami.rhel: Reading...
aws_vpc.aap_vpc: Refreshing state... [id=vpc-0f96df68aae0e16b5]
data.aws_ami.rhel: Read complete after 0s [id=ami-0f7504305008843ad]
aws_internet_gateway.aap_igw: Refreshing state... [id=igw-0d3c2fc0e36476239]
aws_security_group.mqtt_sg: Refreshing state... [id=sg-070840cb055d05729]
aws_subnet.aap_subnet: Refreshing state... [id=subnet-082c6a766ed645f4b]
aws_route_table.aap_pub_igw: Refreshing state... [id=rtb-0e2069101b8b25bb1]
aws_security_group_rule.mqtt_egress_access: Refreshing state... [id=sgrule-3742172340]
aws_security_group_rule.mqtt_ingress_access: Refreshing state... [id=sgrule-3616397365]
aws_route_table_association.aap_rt_subnet_public: Refreshing state... [id=rtbassoc-07537fee07b6e641a]
aws_instance.mqtt_broker: Refreshing state... [id=i-00d3c47f92699676c]
null_resource.mqtt_instance_setup: Refreshing state... [id=777477009075932955]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # ansible_host.aap_instance[0] will be created
  + resource "ansible_host" "aap_instance" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # ansible_host.aap_instance[1] will be created
  + resource "ansible_host" "aap_instance" {
      + groups    = [
          + "gateway",
        ]
      + id        = (known after apply)
      + name      = (known after apply)
      + variables = {
          + "ansible_python_interpreter"   = "/usr/bin/python3"
          + "ansible_ssh_private_key_file" = "~/.ssh/id_rsa"
          + "ansible_user"                 = "ec2-user"
        }
    }

  # aws_instance.aap_instance will be created
  + resource "aws_instance" "aap_instance" {
      + ami                                  = "ami-00267e8bc4a50773c"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = "us-east-2a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.xlarge"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "cloud_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-082c6a766ed645f4b"
      + tags                                 = {
          + "Name"      = "aap_instance"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "aap_instance"
          + "Terraform" = "true"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "1285d1ceb74e8f00e93cdcd5a2eb82b9755dd3e9"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + cpu_options {
          + amd_sev_snp      = (known after apply)
          + core_count       = (known after apply)
          + threads_per_core = (known after apply)
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 100
          + volume_type           = "gp3"
        }
    }

  # aws_instance.mqtt_broker will be updated in-place
  ~ resource "aws_instance" "mqtt_broker" {
        id                                   = "i-00d3c47f92699676c"
        tags                                 = {
            "Name"      = "mqtt_broker"
            "Terraform" = "true"
        }
      ~ vpc_security_group_ids               = [
          - "sg-070840cb055d05729",
        ] -> (known after apply)
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group.aap_security_group will be created
  + resource "aws_security_group" "aap_security_group" {
      + arn                    = (known after apply)
      + description            = "Security Group for AAP Hybrid Node"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "aap-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"      = "AAP-Security-Group"
          + "Terraform" = "true"
        }
      + tags_all               = {
          + "Name"      = "AAP-Security-Group"
          + "Terraform" = "true"
        }
      + vpc_id                 = "vpc-0f96df68aae0e16b5"
    }

  # aws_security_group.mqtt_sg must be replaced
-/+ resource "aws_security_group" "mqtt_sg" {
      ~ arn                    = "arn:aws:ec2:us-east-2:978840727221:security-group/sg-070840cb055d05729" -> (known after apply)
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-070840cb055d05729" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 1883
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 1883
            },
        ] -> (known after apply)
      ~ name                   = "aap-sg" -> "mqtt-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "978840727221" -> (known after apply)
        tags                   = {
            "Name"      = "MQTT-Security-Group"
            "Terraform" = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_security_group_rule.egress_access will be created
  + resource "aws_security_group_rule" "egress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.grpc_ingress_access will be created
  + resource "aws_security_group_rule" "grpc_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 50051
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 50051
      + type                     = "ingress"
    }

  # aws_security_group_rule.http_ingress_access will be created
  + resource "aws_security_group_rule" "http_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # aws_security_group_rule.https_ingress_access will be created
  + resource "aws_security_group_rule" "https_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_security_group_rule.mqtt_egress_access must be replaced
-/+ resource "aws_security_group_rule" "mqtt_egress_access" {
      ~ id                       = "sgrule-3742172340" -> (known after apply)
      ~ security_group_id        = "sg-070840cb055d05729" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-03661a1aaccd529c7" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.mqtt_ingress_access must be replaced
-/+ resource "aws_security_group_rule" "mqtt_ingress_access" {
      ~ id                       = "sgrule-3616397365" -> (known after apply)
      ~ security_group_id        = "sg-070840cb055d05729" -> (known after apply) # forces replacement
      ~ security_group_rule_id   = "sgr-01623667480480070" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_security_group_rule.postgresql_ingress_access will be created
  + resource "aws_security_group_rule" "postgresql_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.redis_ingress_access will be created
  + resource "aws_security_group_rule" "redis_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # aws_security_group_rule.secure_ingress_access will be created
  + resource "aws_security_group_rule" "secure_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 8433
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8433
      + type                     = "ingress"
    }

  # aws_security_group_rule.ssh_ingress_access will be created
  + resource "aws_security_group_rule" "ssh_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # null_resource.aap_instance_setup will be created
  + resource "null_resource" "aap_instance_setup" {
      + id = (known after apply)
    }

  # null_resource.mqtt_instance_setup is tainted, so must be replaced
-/+ resource "null_resource" "mqtt_instance_setup" {
      ~ id = "777477009075932955" -> (known after apply)
    }

Plan: 17 to add, 1 to change, 4 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_fqdn = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*